clear;clc
%https://rdc28.cwb.gov.tw/TDB/public/warning_typhoon_list/
%1989年~2019年7、8、9月間侵台颱風在高雄的累積兩量
%https://rdc28.cwb.gov.tw/TDB/public/precipitation_statistics/
% t1989 = 350.1;
% t1990 = 127.9+33.6+162.0 +30.7 +153.3;
% t1991 = 108.2+8.5+55.4+88.7+45.0+2.0;
% t1992 = 63.5+329.6+121.0+69.3;
% t1993 = 10.6+8.0;
% t1994 = 218.0+30+9.5+1.3+43.4;
% t1995 = 32.2+48.0+16.3+40.8;
% t1996 = 20.3+188.5+183.7+0.6;
% t1997 = 42.0+32.9;
% t1998 = 76.5+153.0+127.5+1.8+72.5;
% t1999 = 137.0+69+19;
% t2000 = 1.5+129.5+23.5+162.1;
% t2001 = 123+5+101+253+3.5+169+7;
% t2002 = 10;
% t2003 = 19.5+48+190+1+27+80.5;
% t2004 = 0.1;
% t2005 = 24.5+363.5+51.5+0.5+82.5+160.5;
% t2006 = 350.5+8.5+28+256.5+112.5+8+12;
% t2007 = 79+50.5+34.5+73.5+8.5+81;
% t2008 = 168+5+149+350.5+26+66.5;
t2009 = 123.5+41.5+811+48.5;
t2010 = 499.5+107+64.5+137+8.5;
t2011 = 0.5+326.5;
t2012 = 108+61.5+232+5.5+162+53;
t2013 = 305+3+70+45.5;
t2014 = 115+106.5+142;
t2015 = 2+18.5+1+59+223;
t2016 = 12+132357+185;
t2017 = 249+7.5+12;
t2018 = 3;
t2019 = 0;
typ_warn = [t2009 t2010 t2011 t2012 t2013 t2014 t2015 t2016 t2017 t2018 t2019]

nor_rain = [200.5+934.5+134.5 437+164.7+853 543+367.5+71.5 52.5+756.5 ...
    185.5+765.7+93.5 309.5+902.0 200+548+140.5 315+427+1098 285+211+32.5...
    410+1600.5+66 500+726.2+1]
year = 2009:2019
% startDay = datenum('2009'); %datenum : Serial date number
% endDay = datenum('2019');   %datenum : 特殊函數
% x1=linspace(startDay,endDay,10);   % 7天的日期，設為 x 軸
plotyy(year,typ_warn,year,nor_rain) %左邊typ_warn，右邊nor_rain，畫出雙y軸圖
% ax= gca;
% ax.XTick = x1; %改變x軸標示
% datetick('x','yy','keepticks')
title('2019高雄的累積兩量')
xlabel('年')
ylabel('侵台颱風在高雄的累積兩量(mm)')
set(gca,'YTick',min(typ_warn):max(typ_warn)); %重設目前Y軸參數之範圍
yyaxis right
% cla
%axis([-inf,inf,20,23])
ylabel('789月累積雨量(mm)')

% set(AX(1),'XColor','k','YColor','b'); %把左邊 x 軸的座標改成藍色
% set(AX(2),'XColor','k','YColor','r'); %把右邊 x 軸的座標改成紅色
% 
% hh1=get(AX(1),'Ylabel');
% set(hh1,'String','侵台颱風在高雄的累積兩量(mm)');
% set(hh1,'color','b');
% 
% hh2=get(AX(2),'Ylabel');
% set(hh2,'String','789月累積雨量(mm)');
% set(hh2,'color','r');